<template>
  <div class="page-content">
    <div class="wrap">
      <h3>利用規約</h3>
      <p>この利用規約（以下、「本規約」といいます。）は、このWebサイトの管理者（以下、「管理者」といいます。）がこのWebサイト上で提供するサービス（以下、「本サービス」といいます。）の利用条件を定めるものです。本サービスを利用される方（以下、「利用者」）は、本規約の内容をご承諾いただいたものとみなしますので、以下の規定を守って利用してください。なお、本規約の内容は、必要に応じて変更することがありますので、ご利用の際には最新の利用規約をご覧ください。</p>
      <h5>本サービス</h5>
      <ol>
        <li>本サービスは、利用者が情報の発信、意見の表明もしくは交換またはこれらの共有等を行うための掲示板を提供するサービスです。</li>
        <li>本サービスは、利用者自らが所有する、Twitter（http://twitter.com）のアカウント（以下「Twitterアカウント」）の認証を利用します。</li>
      </ol>
      <h5>本サービスの利用</h5>
      <p>管理者は、事前に利用者の投稿内容を閲覧することはしません。従って、投稿の内容（真偽、正確性、第三者の権利を侵害していないこと等）やサービス利用の状態については一切保証しておりません。本サービスのご利用は、利用者ご自身の責任において行っていただきます。</p>
      <h5>免責事項</h5>
      <p>利用者が当掲示板の利用により第三者の権利を侵害し、または第三者に対して損害を与えたことに関連して生じた全ての苦情や請求について、管理者は損害賠償その他の責任を負いません。</p>
      <h5>禁止行為</h5>
      <p>本サービスでは以下の行為を禁止します。</p>
      <ol>
        <li>法令または公序良俗に違反する行為</li>
        <li>犯罪行為に関連する行為</li>
        <li>管理者、利用者、または第三者のサーバーまたはネットワークの機能を破壊したり、妨害したりする行為</li>
        <li>管理者のサービスの運営を妨害するおそれのある行為</li>
        <li>他の利用者に関する個人情報等を収集または蓄積する行為</li>
        <li>不正アクセスをし、またはこれを試みる行為</li>
        <li>他の利用者に成りすます行為</li>
        <li>管理者のサービスに関連して、反社会的勢力に対して直接または間接に利益を供与する行為</li>
        <li>管理者、他の利用者または第三者の知的財産権、肖像権、プライバシー、名誉その他の権利または利益を侵害する行為</li>
        <li>以下の表現を含み、または含むと管理者が判断する内容を本サービス上に投稿し、または送信する行為</li>
        <ol>
          <li>過度に暴力的な表現</li>
          <li>露骨な性的表現</li>
          <li>人種、国籍、信条、性別、社会的身分、門地等による差別につながる表現</li>
          <li>自殺、自傷行為、薬物乱用を誘引または助長する表現</li>
          <li>その他反社会的な内容を含み他人に不快感を与える表現</li>
        </ol>
        <li>以下を目的とし、または目的とすると管理者が判断する行為</li>
        <ol>
          <li>営業、宣伝、広告、勧誘、その他営利を目的とする行為（管理者の認めたものを除きます。）</li>
          <li>性行為やわいせつな行為を目的とする行為</li>
          <li>面識のない異性との出会いや交際を目的とする行為</li>
          <li>他の利用者に対する嫌がらせや誹謗中傷を目的とする行為</li>
          <li>管理者、他の利用者、または第三者に不利益、損害または不快感を与えることを目的とする行為</li>
          <li>その他本サービスが予定している利用目的と異なる目的で本サービスを利用する行為</li>
          <li>宗教活動または宗教団体への勧誘行為</li>
          <li>その他、管理者が不適切と判断する行為</li>
        </ol>
      </ol>
      <h5>利用制限および登録抹消</h5>
      <ol>
        <li>管理者は、利用者が以下のいずれかに該当する場合には、事前の通知なく、投稿内容を削除し、利用者に対して本サービスの全部もしくは一部の利用を制限しまたは利用者としての登録を抹消することができるものとします。</li>
        <ol>
          <li>本規約のいずれかの条項に違反した場合</li>
          <li>本サービスについて、最終の利用から一定期間利用がない場合</li>
          <li>その他、管理者が本サービスの利用を適当でないと判断した場合</li>
        </ol>
        <li>管理者は、本項に基づき、管理者が行った行為により利用者に生じた損害について、一切の責任を負いません。</li>
      </ol>
      <h5>退会</h5>
      <p>利用者は、管理者の定める退会手続により、本サービスから退会できるものとします。</p>
      <h5>サービス内容の変更等</h5>
      <p>管理者は、利用者に通知することなく、本サービスの内容を変更しまたは本サービスの提供を中止することができるものとし、これによって利用者に生じた損害について一切の責任を負いません。</p>
      <h5>個人情報の取扱い</h5>
      <p>管理者は、本サービスの利用によって取得する個人情報については、管理者「プライバシーポリシー」に従い適切に取り扱うものとします。</p>
    </div>
    <div class="wrap">
      <h3>プライバシーポリシー</h3>
      <p>本サービスでは以下のようにプライバシーポリシーを定めています。利用者は、本プライバシーポリシーの内容をご承諾いただいたものとみなします。</p>
      <h5>登録情報について</h5>
      <p>本サービスでは、ログインに必要な利用者自らが所有するTwitter（http://twitter.com）のアカウント（以下、「Twitterアカウント」といいます。）に関する情報（アカウント名、アイコン画像URLなど）などの情報を保存しています。これらは本サービス利用の範囲内で管理者並びに管理者と契約関係にあるパートナー社（アクセス解析など）の間で利用されます。</p>
      <p></p>
      <p>また、お問い合わせの際に、メールアドレス等の個人情報をご登録いただく場合がございます。質問に対する回答や必要な情報を電子メールなどでご連絡する場合に利用させていただくものであり、個人情報をご提供いただく際の目的以外では利用いたしません。</p>
      <h5>個人情報の第三者への開示</h5>
      <p>本サービスでは、個人情報は適切に管理し、以下に該当する場合を除いて第三者に開示することはありません。</p>
      <ol>
        <li>利用者ご本人のご了解がある場合</li>
        <li>法令等への協力のため、開示が必要となる場合</li>
      </ol>
      <h5>個人情報の開示、訂正、追加、削除、利用停止</h5>
      <p>利用者ご本人からの個人データの開示、訂正、追加、削除、利用停止のご希望の場合には、ご本人であることを確認させていただいた上、速やかに対応させていただきます。</p>
      <h5>アクセス解析ツールについて</h5>
      <p>本サービスでは、Googleによるアクセス解析ツール「Googleアナリティクス」を利用しています。</p>
      <p>
        このGoogleアナリティクスはトラフィックデータの収集のためにCookieを使用しています。このトラフィックデータは匿名で収集されており、個人を特定するものではありません。この機能はCookieを無効にすることで収集を拒否することが出来ますので、お使いのブラウザの設定をご確認ください。この規約に関して、詳しくは
        <a
          href="https://marketingplatform.google.com/about/analytics/terms/jp/"
        >ここをクリック</a>してください。
      </p>
      <h5>プライバシーポリシーの変更について</h5>
      <p>本サービスは、個人情報に関して適用される日本の法令を遵守するとともに、本ポリシーの内容を適宜見直しその改善に努めます。</p>
      <p>修正された最新のプライバシーポリシーは常に本ページにて開示されます。</p>
    </div>
    <div class="wrap">
      <iframe
        src="https://docs.google.com/forms/d/e/1FAIpQLSf9Wit0dsJtUTf4J973qjsGkS20cQDxFCBGvIGAFzqweQpFBA/viewform?embedded=true"
        width="640"
        height="760"
        frameborder="0"
        marginheight="0"
        marginwidth="0"
      >読み込んでいます…</iframe>
    </div>
  </div>
</template>

<style scoped>
.page-content {
  overflow: scroll;
  height: 100vh;
}
h3 {
  font-weight: bold;
}
h5 {
  font-weight: bold;
}
p {
  font-weight: bold;
}
div.wrap {
  font-weight: bolder;
  border-radius: 15px;
  margin: 20px 5px;
  background: #eff5f6;
  border: 5px solid #e5eeef;
  padding: 20px;
}
</style>